import OverlayHeader from '@components/common/OverlayHeader';
import TitleH from '@components/common/TitleH';
import Icon from '@constants/icon';
import img from '@constants/img';
import { Col, Modal, Row } from 'antd';
import { useEffect, useState } from 'react';
import { useTranslation } from 'react-i18next';
import { useLocation } from 'react-router-dom';
import './board.scss';

const Board = () => {
    const { t } = useTranslation();
    const location = useLocation();

    const [selectedMember, setSelectedMember] = useState(null);
    const [isModalVisible, setIsModalVisible] = useState(false);

    const handleCardClick = (member) => {
        setSelectedMember(member);
        setIsModalVisible(true);
    };

    const handleModalClose = () => {
        setIsModalVisible(false);
        setSelectedMember(null);
    };

    const breadcrumbItems = [
        { label: t('nav_about'), link: '/about' },
        { label: t('AboutMawten2'), link: '/about/board', isBold: true },
    ];

    const breadcrumbItems2 = [
        { label: t('nav_about'), link: '/about' },
        { label: t('AboutMawten1'), link: '/about/executive-management', isBold: true },
    ];

    useEffect(() => {
        console.log(location.pathname);
    }, []);

    const members2 = [
        {
            name: 'حسين المختار', position: 'رئيس  الاستثمار', img: img.emp6, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'إبراهيم المغيصيب', position: 'الرئيس المالي', img: img.emp4, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'د. رائد بن منصور الدخيل', position: 'الرئيس التنفيذي', img: img.emp5, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'أمجد بن عبد الله الماجد', position: 'رئيس الخدمات المشتركة', img: img.emp1, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'م. محمود عليوه', position: 'رئيس المشاريع', img: img.emp3, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'عبد العزيز بن سعد الشهري', position: 'رئيس التسويق والمبيعات', img: img.emp2, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
    ];

    const members = [
        {
            name: 'صباح بن محمد المطلق', position: 'عضو مجلس الإدارة', img: img.emp10, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'حمد بن محمد الموسى', position: 'نائب رئيس مجلس الإدارة', img: img.emp8, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'عبد الحميد بن عبد الله الزامل',
            position: 'رئيس مجلس الإدارة',
            img: img.emp9,
            description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'عبد الله بن سعود الرشود', position: 'عضو مجلس الإدارة', img: img.emp7, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'عبد العزيز بن حمد بن سعيدان', position: 'عضو مجلس الإدارة', img: img.emp14, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'سليمان سليم الحربي', position: 'عضو مجلس الإدارة', img: img.emp11, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'سعود بن محمد السليماني', position: 'عضو مجلس الإدارة', img: img.emp13, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'أحمد بن إبراهيم بن سعيدان', position: 'عضو مجلس الإدارة', img: img.emp15, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
        {
            name: 'خالد بن محمد العمودي', position: 'عضو مجلس الإدارة', img: img.emp12, description: 'هو الشخص المسؤول عن التخطيط والتنظيم والتوجيه والرقابة على فريق العمل لتحقيق أهداف المؤسسة. تشمل مهامه ومسؤولياته المدرجة بناء على نوع الإدارة التي يشغلها (مثل: مدير مشروع، مدير منتج، مدير مالي، ...). بشكل عام، تشمل وضع الخطط الاستراتيجية، توزيع المهام، متابعة الأداء، اتخاذ القرارات، حل المشكلات، والتواصل مع الأطراف المختلفة، لضمان سير العمل بكفاءة وفعالية.'
        },
    ];

    const dataToRender = location.pathname === '/about/board' ? members : members2;

    return (
        <div className="mb-8 pb-8">
            <OverlayHeader
                img={img.aboutCover}
                header={t('القيادة')}
                breadcrumbItems={location.pathname === '/about/board' ? breadcrumbItems : breadcrumbItems2}
            />
            <div className="app_board">
                <header>
                    {location.pathname === '/about/board' ? (
                        <TitleH title={t('DirectorsMembers')} highlight={t('Management')} />
                    ) : (
                        <TitleH title={t('Management')} highlight={t('Executive')} />
                    )}
                </header>

                <main className="board-members mt-5">
                    <Row gutter={[40, 40]} dir="ltr">
                        {dataToRender.map((member, index) => (
                            <Col key={index} xl={8} lg={8} md={12} sm={24} xs={24}>
                                <div className="member-card" onClick={() => handleCardClick(member)} style={{ cursor: 'pointer' }}>
                                    <div className="svg-icon">
                                        <Icon.IconEmp />
                                    </div>
                                    <img src={member.img} alt="member-photo" className="mt-8" />
                                </div>
                                <div className="conetnt" dir="rtl">
                                    <h4>{member.name}</h4>
                                    <p>{member.position}</p>
                                </div>
                            </Col>
                        ))}
                    </Row>
                </main>

                <Modal
                    visible={isModalVisible}
                    onCancel={handleModalClose}
                    footer={null}
                    centered
                    width={880}
                    className="custom-member-modal"
                >
                    {selectedMember && (
                        <div className="member-modal-wrapper" dir="rtl">
                            <div className="modal-content">
                                <div className="image-section">
                                    <img src={selectedMember.img} alt="member" />
                                </div>
                                <div className="text-section">
                                    <h3 className="member-name">{selectedMember.name}</h3>
                                    <p className="member-title">{selectedMember.position}</p>
                                    <p className="member-description">
                                        {selectedMember.description || 'لا توجد تفاصيل متوفرة لهذا العضو حالياً.'}
                                    </p>
                                </div>
                            </div>
                        </div>
                    )}
                </Modal>

            </div>
        </div>
    );
};

export default Board;
